def area(a, b):
    """
        Находит площадь прямоугольника.

            Параметры:
                a (float): Первая сторона прямоугольника.
                b (float): Вторая сторона прямоугольника.

            Возвращаемое значение:
                area (float): Площадь прямоугольника.
    """
    return a * b

def perimeter(a, b):
    """
        Находит периметр прямоугольника.

            Параметры:
                a (float): Первая сторона прямоугольника.
                b (float): Вторая сторона прямоугольника.

            Возвращаемое значение:
                perimeter (float): Периметр прямоугольника.
    """
    return 2*(a + b)
