def area(a, h):
    """
        Находит площадь треугольника.

            Параметры:
                a (float): Сторона треугольника, к которой преведена высота.
                h (float): Высота треугольника.

            Возвращаемое значение:
                area (float): Площадь треугольника.
    """
    return a * h / 2

def perimeter(a, b, c):
    """
       Находит площадь треугольника.

           Параметры:
               a (float): Первая сторона треугольника.
               b (float): Вторая сторона треугольника.
               c (float): Третья сторона треугольника.


           Возвращаемое значение:
               perimeter (float): Периметр треугольника.
   """
    return a + b + c
